-- player.lua

-- =====================================
--        КОНФІГУРАЦІЯ ГРАВЦЯ 
-- =====================================

-- Фізика (Box2D)
	angulardgrag_factor = 1.0
    lineardrag_factor = 1.0
	density = 3.0
    
-- Керування
    engine_power = 150.0
    rotation_speed = 4.0
    sprint_power_multiplier = 2.5  -- У скільки разів швидше летимо
    sprint_drain_speed = 40.0      -- Як швидко витрачається енергія (одиниць на сек)
    sprint_regen_speed = 20.0      -- Як швидко відновлюється
    penalty_energy = 3.0

-- Механіка ривка
    dash_velocity = 40.0
    dash_energy_cost = 30.0
    dash_max_cooldown = 1
                                                                       
ship_shape = {
    { x = 0,   y = -30 }, -- 1. Гострий ніс
    { x = 7,   y = -10 }, -- 2. Праве плече носа
    { x = 12,  y = -5 },  -- 3. Основа переднього крила
    { x = 28,  y = 15 },  -- 4. Кінчик основного крила (дуже гострий)
    { x = 15,  y = 15 },  -- 5. Внутрішній згин крила
    { x = 18,  y = 28 },  -- 6. Правий стабілізатор двигуна
    { x = 0,   y = 20 },  -- 7. Центральна виїмка корми
    { x = -18, y = 28 },  -- 8. Лівий стабілізатор двигуна
    { x = -15, y = 15 },  -- 9. Внутрішній згин лівого крила
    { x = -28, y = 15 },  -- 10. Кінчик лівого крила
    { x = -12, y = -5 },  -- 11. Основа лівого крила
    { x = -7,  y = -10 }  -- 12. Ліве плече носа
}

-- Кольори 
    color = { r = 80, g = 5, b = 0, a = 255 } -- Темно-сизий
    outline_color = { r = 0, g = 200, b = 255, a = 255 } -- Неоновий блакитний
    dash_flash_color = { r = 100, g = 255, b = 255, a = 200 }


    -- Налаштування озброєння
    bullet_speed = 800.0   
    bullet_lifetime = 1.5  -- Час польоту в секундах
    bullet_color = { r = 0, g = 255, b = 200, a = 255 } -- Бірюзовий неон

-- Здоровя гравця
    max_hp = 100

-- Таймери невразливості (i-frames)
    invul_time = 0.4
    cheap_invul_time = 0.1


    -- Налаштування клавіш
key_bindings = {
    up    = "W",
    down  = "S",
    left  = "A",
    right = "D",
    dash  = "Space",  -- Тепер це бічна кнопка миші!
    fire  = "MouseLeft", -- Стрільба на ліву кнопку
    sprint = "LShift" -- Спринт на лівий Shift
}